In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error

In [2]:
train=pd.read_csv(r'C:\Users\aalap\train111.csv')
train

,Unnamed: 0,gender,ethnicity,parental level of education,lunch,test preparation course,reading score,writing score,math score
0,0,male,group C,some college,standard,none,61,62,61
1,1,female,group C,associate's degree,standard,none,62,53,53
2,2,female,group C,some college,free/reduced,completed,75,70,67
3,3,male,group C,some high school,free/reduced,none,76,65,79
4,4,male,group A,high school,free/reduced,none,58,44,53
...,...,...,...,...,...,...,...,...,...
695,695,female,group C,some college,standard,completed,81,79,67
696,696,female,group D,some high school,standard,none,86,82,73
697,697,male,group D,some college,free/reduced,completed,60,63,69
698,698,female,group C,associate's degree,standard,none,77,74,65
699,699,female,group C,associate's degree,free/reduced,none,73,68,64

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Unnamed: 0                   700 non-null    int64
 1   gender                       700 non-null    object
 2   ethnicity                    700 non-null    object
 3   parental level of education  700 non-null    object
 4   lunch                        700 non-null    object
 5   test preparation course      700 non-null    object
 6   reading score                700 non-null    int64
 7   writing score                700 non-null    int64
 8   math score                   700 non-null    int64
dtypes: int64(4), object(5)
memory usage: 49.3+ KB

In [4]:
train.describe()

       Unnamed: 0  reading score  writing score  math score
count   700.00000     700.000000     700.000000  700.000000
mean    349.50000      69.751429      68.497143   66.442857
std     202.21688      14.600877      15.224265   15.249227
min       0.00000      23.000000      15.000000    8.000000
25%     174.75000      60.000000      58.000000   57.000000
50%     349.50000      70.000000      70.000000   66.500000
75%     524.25000      80.000000      79.000000   77.000000
max     699.00000     100.000000     100.000000  100.000000

In [5]:
train.drop(['Unnamed: 0'],axis=1,inplace=True)

In [6]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       700 non-null    object
 1   ethnicity                    700 non-null    object
 2   parental level of education  700 non-null    object
 3   lunch                        700 non-null    object
 4   test preparation course      700 non-null    object
 5   reading score                700 non-null    int64
 6   writing score                700 non-null    int64
 7   math score                   700 non-null    int64
dtypes: int64(3), object(5)
memory usage: 43.9+ KB

In [7]:
train.shape

(700, 8)

In [8]:
train.describe()

       reading score  writing score  math score
count     700.000000     700.000000  700.000000
mean       69.751429      68.497143   66.442857
std        14.600877      15.224265   15.249227
min        23.000000      15.000000    8.000000
25%        60.000000      58.000000   57.000000
50%        70.000000      70.000000   66.500000
75%        80.000000      79.000000   77.000000
max       100.000000     100.000000  100.000000

In [9]:
train.isnull().sum()

gender                         0
ethnicity                      0
parental level of education    0
lunch                          0
test preparation course        0
reading score                  0
writing score                  0
math score                     0
dtype: int64

In [10]:
#Encodding
train = pd.get_dummies(train, columns=['gender','ethnicity', 'parental level of education', 'lunch', 'test preparation course'], drop_first=True)

In [11]:
train.columns

Index(['reading score', 'writing score', 'math score', 'gender_male',
       'ethnicity_group B', 'ethnicity_group C', 'ethnicity_group D',
       'ethnicity_group E', 'parental level of education_bachelor's degree',
       'parental level of education_high school',
       'parental level of education_master's degree',
       'parental level of education_some college',
       'parental level of education_some high school', 'lunch_standard',
       'test preparation course_none'],
      dtype='object')

In [12]:
train.head(2)

,reading score,writing score,math score,gender_male,ethnicity_group B,ethnicity_group C,ethnicity_group D,ethnicity_group E,parental level of education_bachelor's degree,parental level of education_high school,parental level of education_master's degree,parental level of education_some college,parental level of education_some high school,lunch_standard,test preparation course_none
0,61,62,61,1,0,1,0,0,0,0,0,1,0,1,1
1,62,53,53,0,0,1,0,0,0,0,0,0,0,1,1

In [13]:
# Standard Scaling
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()

cols_to_scale = ['reading score', 'writing score', 'math score']
train[cols_to_scale] = sc.fit_transform(train[cols_to_scale])

In [14]:
X = train.drop(['math score'], axis=1)        # Independant Variable / Features
y = train['math score']                       # Dependant Variable / Target

In [15]:
from sklearn.ensemble import ExtraTreesRegressor

model = ExtraTreesRegressor()
model.fit(X, y)

ExtraTreesRegressor(bootstrap=False, ccp_alpha=0.0, criterion='mse',
                    max_depth=None, max_features='auto', max_leaf_nodes=None,
                    max_samples=None, min_impurity_decrease=0.0,
                    min_impurity_split=None, min_samples_leaf=1,
                    min_samples_split=2, min_weight_fraction_leaf=0.0,
                    n_estimators=100, n_jobs=None, oob_score=False,
                    random_state=None, verbose=0, warm_start=False)

In [16]:
model.feature_importances_

array([0.38120179, 0.36117767, 0.13381867, 0.00928836, 0.00840818,
       0.00841815, 0.01407168, 0.00800028, 0.00865877, 0.00365067,
       0.00984995, 0.00767147, 0.02890282, 0.01688154])

In [17]:
#building model
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.20, random_state = 42)

In [18]:
#Linear Regression
mod_lin = LinearRegression()
mod_lin.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [19]:
ypred_lin = mod_lin.predict(X_test)

In [20]:
# As only RMSE will be taken into account, we'll import that
from sklearn.metrics import mean_squared_error as mse
from math import sqrt as r

In [21]:
# Metrics for Linear Regression

rmse_lin = r(mse(y_test, ypred_lin))
print('RMSE Lin:', rmse_lin)

RMSE Lin: 0.3712950757814455

In [36]:
from sklearn.neighbors import KNeighborsRegressor

In [28]:
test_df=pd.read_csv(r'C:\Users\aalap\test111.csv')
test_df

,Unnamed: 0,gender,ethnicity,parental level of education,lunch,test preparation course,reading score,writing score
0,0,female,group C,some college,standard,none,67,72
1,1,male,group E,some college,standard,none,60,59
2,2,female,group C,bachelor's degree,standard,none,93,95
3,3,male,group D,associate's degree,standard,none,48,46
4,4,female,group B,associate's degree,standard,none,76,80
...,...,...,...,...,...,...,...,...
295,295,female,group C,some college,standard,completed,82,77
296,296,female,group C,associate's degree,standard,none,61,58
297,297,female,group D,high school,standard,completed,58,64
298,298,female,group D,master's degree,standard,none,100,100
299,299,male,group B,high school,standard,completed,69,68

In [29]:
test_df.head(3)

,Unnamed: 0,gender,ethnicity,parental level of education,lunch,test preparation course,reading score,writing score
0,0,female,group C,some college,standard,none,67,72
1,1,male,group E,some college,standard,none,60,59
2,2,female,group C,bachelor's degree,standard,none,93,95

In [30]:
# Dropping the irrelevant column
test_df.drop(['Unnamed: 0'], axis=1, inplace=True)

In [31]:
# One Hot Encoding all the categorical columns
test_df = pd.get_dummies(test_df, columns=['gender','ethnicity', 'parental level of education', 'lunch', 'test preparation course'], drop_first=True)

In [32]:
# Predicting the values

pred = mod_lin.predict(test_df)

In [34]:
# Submission

submission = pd.DataFrame({'idx': test_df.index, 'math_score': pred})
submission.to_csv('output112.csv', index=False)